Conditional statements

In [2]:
x = 6
y = 8
# if condition:
if x < y:
 print('Thank you')

Thank you

In [3]:
x = 6
y = 8
# if condition:
if x > y:
 print('Thank you')

In [4]:
x = 6
y = 8

if x > y:
 print('Thank you')
else:
 print('wrong')

wrong

In [6]:
# Nested if
x = 6
y = 8

if x < y:
 print('Thank you')
elif x == y:
 print('Bye')
else:
 print('Done')

Thank you

In [9]:
x = 2
if x<1:
    print('ok')
    print('check2')
print('check')

check

In [11]:
a = int(input('your number'))
if a>=0:
    print('positive')
else:
    print('Negative')

positive

In [13]:
a = int(input('your age'))
if a%2 == 0:
    print('even')
else:
    print('odd')

odd

For Loops

for 'counter' in range('number')

In [14]:
num = int(input('type a number'))
for i in range(num):
    print(i)

0
1
2
3

In [16]:
mylist = [1, 2, 3, 4, 5]
for items in mylist:
    print(items)
#mylist

1
2
3
4
5

In [18]:
fruits = ['apple', 'orange', 'peer', 'melon']

for fruit in fruits:
    print(fruit)

apple
orange
peer
melon

In [20]:
import random

In [23]:
fruits = ['apple', 'orange', 'peer', 'melon']

for i in range(len(fruits)):
    number = random.randint(10,20)
    fruits[i] = fruits[i] + str(number)

print(fruits)

['apple18', 'orange14', 'peer17', 'melon15']

In [24]:
fruits = ['apple', 'orange', 'peer', 'melon']

for i in range(len(fruits)):
    number = random.randint(10,20)
    fruits[i] = fruits[i] + '---->'+str(number)

print(fruits)

['apple---->18', 'orange---->14', 'peer---->20', 'melon---->10']

In [25]:
type(fruits)

list

Files

In [26]:
import pandas as pd

In [34]:
df1 = pd.read_csv('weather_2.csv')
#df1.head(16)

In [35]:
# Dictionary: key & value
fruits = pd.DataFrame({'apple':[30], 'Banana':[15]})
fruits

   apple  Banana
0     30      15

In [36]:
fruits_sale =pd.DataFrame({'apple':[30, 41], 'Banana':[21, 15]}, index = [2017, 2018])
fruits_sale

      apple  Banana
2017     30      21
2018     41      15

In [ ]:
df2 = pd.DataFrame([[1,2,3], [4, 5, 6], [7,8,9]], columns = ['A', 'B', 'C'])
df2

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [38]:
df2 = pd.DataFrame([[1,2,3], [4, 5, 6], [7,8,9]], columns = ['A', 'B', 'C'], index = ['X', 'Y', 'Z'])
df2

   A  B  C
X  1  2  3
Y  4  5  6
Z  7  8  9

In [39]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 366 entries, 0 to 365
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   t          366 non-null    int64
 1   hum%       366 non-null    float64
 2   Tmax       366 non-null    float64
 3   Tmin       366 non-null    float64
 4   Rain       366 non-null    float64
 5   rainydays  366 non-null    int64
 6   Hum        366 non-null    float64
dtypes: float64(5), int64(2)
memory usage: 20.1 KB

In [40]:
df1.describe()

,t,hum%,Tmax,Tmin,Rain,rainydays,Hum
count,366.000000,366.000000,366.000000,366.000000,366.000000,366.000000,366.000000
mean,183.500000,56.836066,22.382514,9.032787,0.872678,0.226776,0.568361
std,105.799338,18.368751,11.081262,8.393590,3.163450,0.419320,0.183688
min,1.000000,20.000000,-1.500000,-16.500000,0.000000,0.000000,0.200000
25%,92.250000,43.725000,12.750000,2.500000,0.000000,0.000000,0.437250
50%,183.500000,57.600000,23.500000,9.500000,0.000000,0.000000,0.576000
75%,274.750000,71.650000,32.500000,15.500000,0.000000,0.000000,0.716500
max,366.000000,92.800000,41.500000,24.500000,39.000000,1.000000,0.928000

In [41]:
df1.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
t,366.0,183.500000,105.799338,1.0,92.25000,183.500,274.7500,366.000
hum%,366.0,56.836066,18.368751,20.0,43.72500,57.600,71.6500,92.800
Tmax,366.0,22.382514,11.081262,-1.5,12.75000,23.500,32.5000,41.500
Tmin,366.0,9.032787,8.393590,-16.5,2.50000,9.500,15.5000,24.500
Rain,366.0,0.872678,3.163450,0.0,0.00000,0.000,0.0000,39.000
rainydays,366.0,0.226776,0.419320,0.0,0.00000,0.000,0.0000,1.000
Hum,366.0,0.568361,0.183688,0.2,0.43725,0.576,0.7165,0.928

In [42]:
df1.shape

(366, 7)

In [44]:
url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv"
web_df =pd.read_csv(url)
web_df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa